# Pandas Tutorial

### Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

### Agenda

## What is Data Frames?
## What is Data Series?
## Different operation in Pandas

In [2]:
## firsrt import panda 
import pandas as pd 
import numpy as np

In [3]:
## Playing with Dataframe

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Coumn4"])

In [4]:
df.head()

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [5]:
df.iloc[:,:]

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [6]:
## take the elements from the colum
df.iloc[:,1:]

      Column2  Column3  Coumn4
Row1        1        2       3
Row2        5        6       7
Row3        9       10      11
Row4       13       14      15
Row5       17       18      19

In [11]:
df.iloc[2:3,2:]

      Column3  Coumn4
Row3       10      11

In [12]:
##convert Dataframe into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [13]:
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [14]:
df['Column2'].value_counts()

1     1
5     1
9     1
13    1
17    1
Name: Column2, dtype: int64

In [17]:
df=pd.read_csv()

SyntaxError: invalid syntax (1096499717.py, line 1)